---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderLineStyle
source: html/1dd7a291-7f03-24b8-88c9-4c61764a1d3c.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderLineStyle Property

Indicates if the border line style characteristic is overridden.

## Syntax (C#)
```csharp
public bool BorderLineStyle { get; set; }
```